app/views/projects/index.html.erb

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 2]]
---
  <li>
    <%= link_to project.title, project_path(project.id) %> (<%= project.tasks.unfinished.count %>/<%= project.tasks.count %>)