app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "999"], ["created_at", "2016-02-17 09:50:24.248858"], ["updated_at", "2016-02-17 09:50:24.248858"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "p1888"], ["updated_at", "2016-02-24 08:50:06.438110"], ["id", 1]]
---
  def update
    if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 5]]
---
  def destroy
    @project.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_project
      @project = Project.find(params[:id])