app/controllers/tasks_controller.rb

  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.create(task_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "tasks" ("title", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "777"], ["project_id", 7], ["created_at", "2017-03-11 06:51:53.237576"], ["updated_at", "2017-03-11 06:51:53.237576"]]

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]